01 RECORD-LAYOUT.
   05 COUNTER PIC 9(2).
   05 ARRAY-DATA OCCURS 1 TO 3 TIMES DEPENDING ON COUNTER.
      10 ITEM-ID PIC X(3).
      10 ITEM-VALUE PIC 9(2).