01 DIALECT-RECORD.
   05 RECORD-ID PIC 9(3).
   05 ARRAY-COUNT PIC 9(3).
   05 STATUS-CODE PIC 9(2).
   05 FILLER PIC X(5).
   05 DATA-ARRAY OCCURS 5 TO 9 TIMES DEPENDING ON ARRAY-COUNT PIC X(10).
