       01  NON-TAIL.
           05  A    PIC X.
           05  TBL  PIC X OCCURS 0 TO 3 DEPENDING ON N.
           05  B    PIC X.
           05  N    PIC 9(2).
