       01 ORDER_RECORD.
          05 ORDER_ID      PIC X(8).
          05 CUSTOMER_NAME PIC X(14).
          05 STATUS        PIC X(1).
          05 FLAG          PIC X(1).
